using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.IO;
using static System.IO.File;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace WindowsFormsApp2
{
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }

        private void listBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            if (listBox1.SelectedItem == "AEPp")
            {
                label1.Text = "AEP";
                label2.Text = "Deikths timwn";
            }
            else if (listBox1.SelectedItem == "AEP")
            {
                label1.Text = "P";
                label2.Text = "Q";
            }
            else if (listBox1.SelectedItem == "Posostia Metabolh AEPp")
            {
                label1.Text = "AEPp1";
                label2.Text = "AEPp2";
            }
            else if (listBox1.SelectedItem == "Deikths timwn")
            {
                label1.Text = "P bashs";
                label2.Text = "P2";
            }
            else if (listBox1.SelectedItem == "KEx")
            {
                label1.Text = "Qx";
                label2.Text = "Qy";
            }
            else if (listBox1.SelectedItem == "KEy")
            {
                label1.Text = "Qx";
                label2.Text = "Qy";
            }

        }

        private void label1_Click(object sender, EventArgs e)
        {

        }

        private void button1_Click(object sender, EventArgs e)
        {
            if (!String.IsNullOrEmpty(textBox1.Text) && !String.IsNullOrEmpty(textBox2.Text))
            {
                if (listBox1.SelectedItem == "AEPp")
                {
                    try
                    {
                        label3.Text = ((Convert.ToDouble(textBox1.Text)) / (Convert.ToDouble(textBox2.Text)) * 100).ToString();
                        listaApot.Text = listaApot.Text + "\r\n AEPp = " + label3.Text;
                    }
                    catch
                    {
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else if (listBox1.SelectedItem == "AEP")
                {
                    try
                    {
                        label3.Text = ((Convert.ToDouble(textBox1.Text)) * (Convert.ToDouble(textBox2.Text))).ToString();
                        listaApot.Text = listaApot.Text + "\r\n AEP = " + label3.Text;
                    }
                    catch
                    {
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else if (listBox1.SelectedItem == "Posostia Metabolh AEPp")
                {
                    try
                    {
                        label3.Text = (((((Convert.ToDouble(textBox2.Text)) - (Convert.ToDouble(textBox1.Text))) / (Convert.ToDouble(textBox1.Text))) * 100).ToString()) + "%";
                        listaApot.Text = listaApot.Text + "\r\n Posostiaia metabolh AEPp = " + label3.Text;
                    }
                    catch
                    {
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else if (listBox1.SelectedItem == "Deikths timwn")
                {
                    try
                    {
                        label3.Text = ((Convert.ToDouble(textBox2.Text)) / (Convert.ToDouble(textBox1.Text))).ToString();
                        listaApot.Text = listaApot.Text + "\r\n Deikths timwn = " + label3.Text;
                    }
                    catch
                    {
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else if (listBox1.SelectedItem == "KEx")
                {
                    try
                    {
                        label3.Text = ((Convert.ToDouble(textBox2.Text)) / (Convert.ToDouble(textBox1.Text))).ToString();
                        listaApot.Text = listaApot.Text + "\r\n KEx = " + label3.Text;
                    }
                    catch{
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else if (listBox1.SelectedItem == "KEy")
                {
                    try
                    {
                        label3.Text = ((Convert.ToDouble(textBox1.Text)) / (Convert.ToDouble(textBox2.Text))).ToString();
                        listaApot.Text = listaApot.Text + "\r\n KEy = " + label3.Text;
                    }
                    catch
                    {
                        label3.Text = "ONLY NUMBERS!";
                    }
                }
                else
                {
                    label3.Text = "Dialeje ti 8es na upologiseis";
                }
            }
            
        }

        private void label5_Click(object sender, EventArgs e)
        {

        }

        private void tabPage1_Click(object sender, EventArgs e)
        {

        }

        private void treeView1_AfterSelect(object sender, TreeViewEventArgs e)
        {
            if (treeView1.SelectedNode.Name == "tree11")
            {
                textBox3.Text = "Το οικονομικό πρόβλημα κάθε κοινωνίας προέρχεται από τη διαφορά που υπάρχει μεταξύ του πλήθους των αναγκών που οι άνθρωποι επιδιώκουν να ικανοποιήσουν και του περιορισμένου όγκου των αγαθών που υπάρχουν για την ικανοποίηση αυτών των αναγκών. Με άλλα λόγια, τα αγαθά που διαθέτει μια οικονομία βρίσκονται σε έλλειψη σχετικά με τις ανάγκες των ανθρώπων. Η ουσία λοιπόν του οικονομικού προβλήματος βρίσκεται στη σχετική έλλειψη ή στενότητα των αγαθών. Αυτήν ακριβώς την έλλειψη αγαθών προσπαθούν οι άνθρωποι να ξεπεράσουν με την οργανωμένη δραστηριότητα, με την ανάπτυξη της τεχνολογίας, με την εξεύρεση νέων παραγωγικών πόρων κτλ. \r\n Κάθε οικονομικό αγαθό είναι αποτέλεσμα παραγωγικής διαδικασίας, στην οποία χρησιμοποιούνται οι συντελεστές της παραγωγής. Κατά συνέπεια,η σχετική έλλειψη αγαθών είναι στην πραγματικότητα έλλειψη παραγωγικών συντελεστών. Το πρόβλημα αυτό είναι μόνιμο και απασχολεί κάθε κοινωνία.";
            }
            else if (treeView1.SelectedNode.Name == "tree12")
            {
                textBox3.Text = "Αντικείμενο της Πολιτικής Οικονομίας (ή της Οικονομικής Επιστήμης) είναι η μελέτη των οικονομικών προβλημάτων που δημιουργούνται μέσα σε μια κοινωνία. Τα προβλήματα αυτά είναι πολλά και ποικίλα. Όμως μπορούν να καταταγούν σε τέσσερις κατηγορίες, που μπορούν να εκφραστούν με την μορφή ερωτημάτων ως εξής:\r\nΠοια προϊόντα παράγονται σε μια κοινωνία και σε τι ποσότητες, (σε μια ορισμένη χρονική περίοδο, π .χ. ένα έτος);\r\nΜε ποιον τρόπο παράγονται αυτά τα προϊόντα;\r\nΠώς γίνεται η διανομή των προϊόντων στα μέλη της κοινωνίας;\r\nΠώς μπορεί να αυξηθεί η ποσότητα των παραγόμενων προϊόντων πώς δηλαδή αναπτύσσεται η οικονομία μιας κοινωνίας;\r\nΗ σημασία αυτών των ερωτημάτων γίνεται εύκολα αντιληπτή, αν εξετάσουμε μια εξαιρετικά απλή και υποθετική οικονομία, σαν αυτή του Ροβινσώνα Κρούσου. Ο Κρούσος είναι ο ήρωας του ομώνυμου έργου του άγγλου συγγραφέα Daniel Defoe (1660-1731), που ναυαγεί σε ένα έρημο νησί και ζει εκεί για ένα μεγάλο χρονικό διάστημα. Η οικονομία του Κρούσου, δηλ. του ενός ατόμου, μέσα στο φυσικό περιβάλλον του νησιού έχει χρησιμοποιηθεί πολλές φορές ως παράδειγμα μιας απλής οικονομίας.";
            }
            else if (treeView1.SelectedNode.Name == "tree13")
            {
                textBox3.Text = "Η ζήτηση των αγαθών είναι αποτέλεσμα της συμπεριφοράς των ανθρώπων, στην προσπάθειά τους να ικανοποιήσουν τις πολλές και διάφορες ανάγκες τους. Την οικονομία ενδιαφέρουν οι οικονομικές ανάγκες, εκείνες, δηλαδή, που για την ικανοποίησή τους χρησιμοποιούνται οικονομικά αγαθά.\r\nΙδιότητες των αναγκών\r\n\r\nα) Εξέλιξη\r\nΟ όρος εξέλιξη αναφέρεται στη διαφοροποίηση των αγαθών που χρησιμοποιούνται για την ικανοποίηση της ίδιας ανάγκης. Για παράδειγμα, την ανάγκη του για θέρμανση ο άνθρωπος την ικανοποιούσε πολύ παλιά με φωτιά, αργότερα με σόμπες -αρχικά ξύλου, μετά υγραερίου ή ηλεκτρικού ρεύματος και στη σύγχρονη εποχή με καλοριφέρ ή κλιματιστικό μηχάνημα.\r\n\r\nβ) Πολλαπλασιασμός\r\nΠολλαπλασιασμός των αναγκών σημαίνει δημιουργία νέων αναγκών. Για παράδειγμα, η ανάγκη για τηλεόραση δεν υπήρχε για τον Έλληνα καταναλωτή πριν το 1965, ενώ σήμερα υπάρχει σε κάθε σπίτι μια συσκευή τηλεόρασης. Βασικοί λόγοι που συντελούν στον πολλαπλασιασμό και την εξέλιξη των αναγκών είναι οι εξής:\r\n\r\n1. Η τεχνολογία. Αποτέλεσμα της τεχνολογικής προόδου είναι η συνεχής ανακάλυψη νέων προϊόντων. Από τα νέα αυτά προϊόντα, άλλα καλύπτουν περισσότερο ικανοποιητικά τις ήδη υπάρχουσες ανάγκες, όπως η ηλεκτρονική φωτογραφική μηχανή, και άλλα δημιουργούν νέες ανάγκες, όπως ο ηλεκτρονικός υπολογιστής.\r\n\r\n2. Η μίμηση. Η έμφυτη τάση των ανθρώπων να μιμούνται τους άλλους συντελεί στη δημιουργία νέων αναγκών. Για παράδειγμα, η κατανάλωση χριστουγεννιάτικων δέντρων στη χώρα μας είναι αποτέλεσμα μίμησης εθίμου άλλης χώρας.\r\n\r\n3. Η συνήθεια. Η τάση των ανθρώπων να ζητούν την επανάληψη μιας απόλαυσης από τη χρησιμοποίηση ενός αγαθού οδηγεί τελικά στην ανάγκη γι' αυτό το αγαθό. Οι άνθρωποι συνηθίζουν εύκολα σε νέα προϊόντα, όταν τα χρησιμοποιήσουν αρκετές φορές. Ακούμε συχνά την έκφραση <το συνήθισα και μου έγινε ανάγκη>.\r\n\r\n4. Η διαφήμιση. Η διαφήμιση επιδρά ψυχολογικά στον καταναλωτή και του δημιουργεί την επιθυμία απόκτησης αγαθών, δηλαδή δημιουργία αναγκών που διαφορετικά δε θα υπήρχαν. Η τεράστια ανάπτυξη των μέσων μαζικής επικοινωνίας και κυρίως η τηλεόραση έδωσαν στη διαφήμιση τη δυνατότητα να πλησιάσει τον καταναλωτή, ανεξάρτητα από ηλικία, και να του <επιβάλει> νέα προϊόντα, αυξάνοντας τις ανάγκες του και οδηγώντας τον σε «υπερκατανάλωση.\r\n\r\nγ) Ο κορεσμός\r\nΟι ανάγκες ως σύνολο είναι απεριόριστες ή ακόρεστες, αλλά κάθε μια ανάγκη ξεχωριστά υπόκειται σε προσωρινό κορεσμό. Αυτό σημαίνει ότι σε μια συγκεκριμένη χρονική περίοδο, όσο αυξάνεται η ποσότητα ενός συγκεκριμένου αγαθού που χρησιμοποιείται για την ικανοποίηση μιας ανάγκης, τόσο η ένταση αυτής της ανάγκης μειώνεται, ώσπου επέρχεται πλήρης ικανοποίηση ή κορεσμός. Αυτός ο κορεσμός είναι προσωρινός.Για παράδειγμα, η ανάγκη για νερό από ένα διψασμένο άτομο μετά την κατανάλωση ορισμένης ποσότητας νερού παύει να υφίσταται προσωρινά.Η ταχύτητα με την οποία επέρχεται ο κορεσμός μιας ανάγκης είναι θέμα υποκειμενικό, δηλαδή διαφέρει από άτομο σε άτομο. Παράδειγμα, η ανάγκη για κρέας ή αυτοκίνητα ικανοποιείται με ποσότητες που δεν είναι ίδιες για όλα τα άτομα.";
            }
            else if (treeView1.SelectedNode.Name == "tree14")
            {
                textBox3.Text = "Η επιβίωση και η ευδαιμονία των ατόμων σε μια σύγχρονη οικονομία απαιτεί την ύπαρξη πολλών υλικών αντικειμένων ή υπηρεσιών με τα οποία ικανοποιούνται οι ανάγκες τους\r\n\r\nΟρισμένα από τα αγαθά αυτά βρίσκονται ελεύθερα στην φύση, όπως το φως, η θερμότητα του ήλιου, κτλ. Τα αγαθά αυτά συνήθως ονομάζονται ελεύθερα αγαθά και δεν αποτελούν αντικείμενο μελέτης της Οικονομικής Επιστήμης.\r\n\r\nΑντίθετα, η Οικονομική Επιστήμη μελετάει εκείνα τα αγαθά που είναι αποτέλεσμα της παραγωγικής προσπάθειας των ανθρώπων. Αυτά ονομάζονται οικονομικά αγαθά ή προϊόντα (επειδή παράγονται με κάποια διαδικασία) ή εμπορεύματα (επειδή γίνονται αντικείμενα αγοράς και πώλησης). Το κύριο χαρακτηριστικό των οικονομικών αγαθών είναι ότι βρίσκονται σε περιορισμένες ποσότητες σε σχέση με τις ανάγκες που ικανοποιούν. Στο εξής, όταν λέμε αγαθά, θα εννοούμε πάντοτε τα οικονομικά αγαθά. Τα αγαθά μπορεί να ταξινομηθούν σε κατηγορίες με βάση διάφορα κριτήρια:\r\n\r\n(i) Υλικά και Άυλα αγαθά ή Υπηρεσίες\r\nΤα αγαθά μπορούν να έχουν οποιαδήποτε μορφή. Έχουμε υλικά αγαθά, όπως τα τρόφιμα και τα ρούχα, και άυλα αγαθά ή υπηρεσίες, όπως ένα μουσικό κομμάτι, μια διάλεξη. Στα άυλα αγαθά περιλαμβάνονται και διάφορες καταστάσεις ή μορφές ενέργειας, όπως η θερμότητα το χειμώνα, το φως το βράδυ.\r\n\r\n(ii) Διαρκή και Καταναλωτά Αγαθά\r\nΜια άλλη διάκριση είναι σε διαρκή και σε καταναλωτά. Διαρκή είναι εκείνα που μπορούν να χρησιμοποιηθούν πολλές φορές για τον ίδιο σκοπό, χωρίς να μεταβληθεί η φυσική τους υπόσταση. Π.χ. τα έπιπλα, τα ρούχα, τα αυτοκίνητα, κτλ. Καταναλωτά είναι εκείνα που μόνο μια φορά μπορούν να χρησιμοποιηθούν για το σκοπό που έχουν παραχθεί. Π.χ. τα τρόφιμα, τα καυσόξυλα, η βενζίνη, τα τσιγάρα κτλ.\r\n\r\n(ii) Κεφαλαιουχικά και Καταναλωτικά Αγαθά\r\nΜία πολύ σημαντική διάκριση των αγαθών είναι σε κεφαλαιουχικά (ή επενδυτικά) και σε καταναλωτικά. Κεφαλαιουχικά αγαθά είναι εκείνα που χρησιμοποιούνται στην παραγωγική διαδικασία από την οποία παράγονται άλλα αγαθά. Π.χ. Το τρακτέρ που χρησιμοποιείται στην αγροτική παραγωγή, ο αργαλειός που χρησιμοποιείται για την παραγωγή υφάσματος, το κτίριο ενός εργοστασίου. Γενικά, κεφαλαιουχικά αγαθά είναι τα μηχανήματα, τα κτίρια, τα εργαλεία, οι δρόμοι, τα πλοία, οι σταθμοί παραγωγής ηλεκτρικού ρεύματος, κτλ. Καταναλωτικά αγαθά είναι εκείνα που χρησιμοποιούνται για την άμεση ικανοποίηση των αναγκών των ανθρώπων, δηλαδή για κατανάλωση. Π.χ. Τα πορτοκάλια, η γραβάτα, το στερεοφωνικό κτλ. Είναι φυσικό ένα αγαθό να ανήκει σε περισσότερες από μια κατηγορίες. Η σοκολάτα είναι υλικό, καταναλωτό και καταναλωτικό αγαθό. Το ψυγείο είναι υλικό, διαρκές και καταναλωτικό αγαθό. Το πιεστήριο του τυπογραφείου είναι υλικό διαρκές και κεφαλαιουχικό αγαθό.\r\n\r\nΕπίσης το ίδιο το αγαθό μπορεί να ανήκει σε δύο κατηγορίες, ανάλογα με το σκοπό της χρήσης του. Π.χ. ένα βιβλίο στο σπίτι μας είναι καταναλωτικό αγαθό, ενώ το ίδιο βιβλίο αν ανήκει στη βιβλιοθήκη ενός πανεπιστημίου, είναι κεφαλαιουχικό αγαθό. Το ιδιωτικό αυτοκίνητο μιας οικογένειας είναι καταναλωτικό αγαθό, ενώ το ίδιο αυτοκίνητο, αν ανήκει σε μια εταιρεία είναι κεφαλαιουχικό αγαθό";
            }
            else if (treeView1.SelectedNode.Name == "tree15")
            {
                textBox3.Text = "Τα προϊόντα της παραγωγής, δηλαδή τα οικονομικά αγαθά, από άλλους πωλούνται και από άλλους αγοράζονται. Ο χώρος, όπου γίνονται αγοραπωλησίες ονομάζεται αγορά. Π.χ. ο εμπορικός δρόμος μιας πόλης όπου βρίσκονται τα μαγαζιά θεωρείται η αγορά της. Εν τούτοις μια αγοραπωλησία μπορεί να γίνει και με ένα τηλεφώνημα, με ένα τηλεγράφημα, στο γραφείο ενός συμβολαιογράφου ή οπουδήποτε αλλού. Γι' αυτό η έννοια της αγοράς δεν περιορίζεται σε ένα γεωγραφικό χώρο, αλλά περιλαμβάνει όλα εκείνα τα μέσα με τα οποία μπορεί να πραγματοποιηθεί μια αγοραπωλησία και όλους τους σχετικούς χώρους.\r\n\r\nΠαραδείγματα αγορών είναι η λαϊκή αγορά στη γειτονιά σας, η λαχαναγορά της Αθήνας, το Χρηματιστήριο Αθηνών. Συχνά οι αγορές αναφέρονται με το όνομα των αγαθών που είναι αντικείμενο αγοραπωλησίας, όπως η αγορά γης ή ακόμα η αγορά αγροτικής γης, η αγορά τίτλων (ομολόγων και μετοχών) στο χρηματιστήριο, η αγορά εργασίας κτλ";
            }
            else if (treeView1.SelectedNode.Name == "tree16")
            {
                textBox3.Text = "Η λειτουργία της οικονομίας βασίζεται στην ύπαρξη και στη συμπεριφορά των ατόμων, τα οποία όμως είναι οργανωμένα σε συγκεκριμένες κοινωνικές οντότητες. Σπουδαιότερες από αυτές είναι η οικογένεια (ή νοικοκυριό), η επιχείρηση, το εργατικό σωματείο και το κράτος. Είναι σκόπιμο σ' αυτό το σημείο να περιγράψουμε αυτές τις οντότητες με συντομία.\r\n\r\n(i) Η Οικογένεια ή το Νοικοκυριό.\r\nΣυνήθως το νοικοκυριό ταυτίζεται με την οικογένεια. Το νοικοκυριό όμως μπορεί να αποτελείται από ένα άτομο που ζει μόνο του ή από μια οικογένεια, μαζί με την οποία ζει και ένα άλλο ή περισσότερα άτομα. Το κύριο χαρακτηριστικό του νοικοκυριού είναι ότι αποτελείται από άτομα που αποφασίζουν από κοινού για τα οικονομικά θέματα.\r\n\r\nΣε κάθε χρονική περίοδο (π.χ. ένα μήνα ή ένα έτος) το νοικοκυριό εισπράττει διάφορα εισοδήματα, που προέρχονται από την περιουσία του (π.χ. ενοίκια) ή την εργασία των μελών του (π.χ. σύνταξη των ηλικιωμένων και μισθός των εργαζόμενων μελών). Έτσι, έχει ένα συνολικό εισόδημα που βραχυπρόθεσμα δε μεταβάλλεται σημαντικά και μπορεί να θεωρηθεί σταθερό.\r\n\r\nΣυνειδητά ή ασυνείδητα το νοικοκυριό παίρνει τρεις οικονομικές αποφάσεις σχετικά με τη χρησιμοποίηση του εισοδήματος του: (α) πόσο μέρος του εισοδήματος θα καταναλώσει, δηλαδή θα δαπανήσει για αγορά διάφορων αγαθών και πόσο θα αποταμιεύσει, δηλαδή θα φυλάξει για να δαπανήσει στο μέλλον, (β) το μέρος που θα καταναλωθεί, σε ποια προϊόντα και σε ποιες αναλογίες θα δαπανηθεί, και (γ) το μέρος του εισοδήματος που θα αποταμιευθεί, πότε θα χρησιμοποιηθεί και για ποιο σκοπό\r\n\r\nΟι αποφάσεις αυτές του νοικοκυριού επηρεάζονται από πολλούς παράγοντες, όπως: (α) Το μέγεθος του εισοδήματος, (β) το μέγεθος του νοικοκυριού και την ηλικία των μελών του. Όσο μεγαλύτερο είναι το νοικοκυριό, τόσο μεγαλύτερο είναι και το μέγεθος της κατανάλωσης. Επίσης, διαφορετικά προϊόντα αγοράζει μια οικογένεια με μικρά παιδιά απ' ό,τι μια οικογένεια με ηλικιωμένα άτομα, (γ) η γεωγραφική θέση όπου είναι εγκατεστημένο, (δ) Το κοινωνικό περιβάλλον μέσα στο οποίο ζουν τα μέλη του.\r\n\r\nΜια πολύ σημαντική απόφαση κάθε νοικοκυριού, διαφορετική σε χαρακτήρα από τις προηγούμενες, είναι σχετικά με το ποια μέλη της οικογένειας θα δουλεύουν για την απόκτηση εισοδήματος. Παραδοσιακά, επικρατούσε η άποψη ότι ο άνδρας πρέπει να δουλεύει και ότι φέρνει την κύρια ευθύνη για την οικονομική πρόοδο της οικογένειας. Το ερώτημα ήταν, αν και πόσο θα δουλέψει η γυναίκα, καθώς επίσης και αν και πότε θα δουλέψουν τα παιδιά της οικογένειας ή θα σπουδάσουν κτλ. Αυτό είναι το πρόβλημα της προσφοράς εργασίας του νοικοκυριού, που είναι αρκετά περίπλοκο και δε χρειάζεται να σχολιαστεί πιο πολύ.\r\n\r\nΒασική επιδίωξη του νοικοκυριού και κριτήριο ταυτόχρονα για τη λήψη των πιο πάνω αποφάσεων είναι η όσο το δυνατόν πληρέστερη ικανοποίηση των αναγκών του με βάση το δεδομένο εισόδημα που έχει στην διάθεση του. Στο σημείο αυτό πρέπει να γίνουν δύο παρατηρήσεις: Πρώτο, οι αποφάσεις του νοικοκυριού δεν παίρνονται χωριστά η καθεμιά, αλλά σε συνδυασμό. Π.χ. Η απόφαση για τα μέλη της οικογένειας που θα δουλέψουν μπορεί να παρθεί σε συνδυασμό με την απόφαση για την αγορά διαμερίσματος. Δεύτερο, μεταξύ των νοικοκυριών υπάρχουν σημαντικές διαφορές. Ορισμένα νοικοκυριά\r\n\r\nαποτελούν και επιχείρηση, π.χ. ένα αγροτικό νοικοκυριό, οπότε πρέπει να πάρουν αποφάσεις και ως καταναλωτικές, αλλά ταυτόχρονα και ως επιχειρηματικές μονάδες.\r\n\r\n(ii) Η Επιχείρηση\r\nΟι επιχειρήσεις είναι παραγωγικές μονάδες με διάφορες νομικές μορφές (ανώνυμη εταιρεία, ΕΠΕ κτλ.), με διαφορετικό μέγεθος και αντικείμενο, στις οποίες ένα ή περισσότερα άτομα παίρνουν αποφάσεις σχετικά με την παραγωγή. Με τις αποφάσεις αυτές προσδιορίζεται: (α) τι προϊόν θα παράγει η επιχείρηση, (β) σε τι ποσότητα θα το παράγει, (γ) ποια μέθοδο παραγωγής θα χρησιμοποιήσει, δηλαδή ποια τεχνολογία, (δ) σε ποιο μέρος θα εγκατασταθεί η επιχείρηση, (ε) σε ποια τιμή θα πουλάει το προϊόν, και διάφορα άλλα μικρότερης σημασίας προβλήματά της.\r\n\r\nΑντικειμενικός σκοπός της επιχείρησης και οδηγός της στη λήψη των διάφορων αποφάσεων είναι η μεγιστοποίηση του κέρδους, δηλαδή η επίτευξη του μεγαλύτερου δυνατού κέρδους.\r\n\r\nΚι αυτό, γιατί, όσο μεγαλύτερο είναι το κέρδος μιας επιχείρησης, τόσο πιο βέβαιη θα είναι η επιβίωσή της και η ανάπτυξή της μακροχρόνια.\r\n\r\nΜια επιχείρηση, για να πετύχει το μεγαλύτερο δυνατό κέρδος, πρέπει να πουλάει, όσο το δυνατό μεγαλύτερες ποσότητες του προϊόντος στη μεγαλύτερη δυνατή τιμή και να παράγει τις ποσότητες αυτές με το χαμηλότερο δυνατό κόστος.\r\n\r\nΣτις μεγάλες επιχειρήσεις με μεγάλα χρηματικά κεφάλαια και με πολυπληθές εργατικό δυναμικό και με επιστημονικό προσωπικό, η προσπάθεια για τη μεγιστοποίηση του κέρδους είναι φανερή και προγραμματισμένη. Σε μικρές επιχειρήσεις, όπως μια βιοτεχνία ή ένα μικρό εμπορικό στη γειτονιά σας, η προσπάθεια για το μέγιστο κέρδος μπορεί να μην είναι συνειδητή ή φανερή. Ακόμη, ένας μικροεπιχειρηματίας μπορεί να αποβλέπει σε ένα ορισμένο εισόδημα, χωρίς να ενδιαφέρεται για το μέγιστο. Παρά τις εξαιρέσεις που μπορούμε να βρούμε, ο κανόνας είναι ότι οι επιχειρήσεις επιδιώκουν το μέγιστο κέρδος και οι αποφάσεις τους βασίζονται σ' αυτήν την επιδίωξη.\r\n\r\n(iii) Το Εργατικό Σωματείο\r\nΤα εργατικά σωματεία είναι οργανώσεις εργαζομένων με αντικειμενικό σκοπό την προώθηση των κοινών συμφερόντων των μελών τους και συγκεκριμένα τη βελτίωση της οικονομικής τους κατάστασης.\r\n\r\nΗ δημιουργία και ανάπτυξη των εργατικών σωματείων συμπίπτει χρονικά με την εξάπλωση της βιομηχανικής επανάστασης στην Αγγλία στο τέλος του δέκατου όγδοου (18ου) αιώνα. Οι μεταβολές που επέφερε η βιομηχανική επανάσταση δημιούργησαν τις συνθήκες που οδήγησαν στο σχηματισμό των εργατικών ενώσεων. Η πιο σημαντική μεταβολή είναι η μετακίνηση του αγροτικού πληθυσμού προς τις αναπτυσσόμενες βιομηχανικές περιοχές, που κατέληξε στη δημιουργία μιας πολυάριθμης τάξης εργατών με μόνη πηγή εισοδήματος την αμοιβή τους από την απασχόληση στη βιομηχανία. Το αίσθημα της\r\n\r\nανασφάλειας, λόγω της έλλειψης άλλων μέσων συντήρησης, και το ενδεχόμενο της ανεργίας είναι οι κύριοι παράγοντες που οδήγησαν τους εργάτες στη δημιουργία επαγγελματικών ενώσεων, με σκοπό τη βελτίωση της θέσης τους. Κάθε εργάτης χωριστά δεν έχει καμία δύναμη απέναντι στον εργοδότη. Αντίθετα, με την απειλή της απόλυσης και της ανεργίας ο εργοδότης μπορεί να επιβάλλει τους δικούς του όρους στις σχέσεις του με τους εργάτες.\r\n\r\nΗ οργάνωση των εργατών σε σωματεία επιτρέπει τη διαπραγμάτευση με τον εργοδότη και την εξασφάλιση καλύτερων όρων απασχόλησης. Με άλλα λόγια, τα εργατικά σωματεία μπορεί να θεωρηθούν ως το αντιστάθμισμα στην οικονομική δύναμη του εργοδότη. Κατά συνέπεια, η δημιουργία των εργατικών σωματείων είναι αποτέλεσμα της αδύναμης θέσης στην οποία βρίσκονται οι εργάτες και της συνειδητοποίησης των πλεονεκτημάτων που μπορούν να αποκομίσουν, αν ενεργούν ως σύνολο, παρά ως μεμονομένα άτομα.\r\n\r\nΕίναι σκόπιμο να διευκρινίσουμε ότι συχνά, αντί του όρου εργατικό σωματείο, χρησιμοποιούνται οι όροι εργατική ένωση ή εργατικό συνδικάτο (από την γαλλική λέξη syndicat και την αγγλική syndicate που προέρχονται από την ελληνική σύνδικος)*.\r\n\r\n(iv) Το Κράτος\r\nΤο Κράτος είναι η ισχυρότερη συλλογική οντότητα και η συμπεριφορά του επηρεάζει σε σημαντικό βαθμό την οικονομική ζωή της χώρας και τις αποφάσεις των επιχειρήσεων και των νοικοκυριών. Παρεμβαίνει στην οικονομική ζωή των επιχειρήσεων με την επιβολή φορολογίας και με την παροχή διάφορων διευκολύνσεων. Επίσης, παρεμβαίνει στην οικονομική ζωή των νοικοκυριών με την επιβολή φόρων και με την παροχή επιδομάτων, διάφορων αγαθών κτλ. Παράλληλα, το κράτος ασκεί διάφορες παραγωγικές λειτουργίες για <δωρεάν> παροχή αγαθών στους πολίτες, όπως προστασία, παιδεία, περίθαλψη κτλ. Οι λόγοι για τους οποίους το κράτος παρεμβαίνει στην οικονομική ζωή των ανθρώπων καθώς και οι λειτουργίες του θα αναφερθούν λεπτομερέστερα σε επόμενο κεφάλαιο. Μπορεί όμως να τονιστεί από τώρα ότι\r\n\r\nεπιδίωξη του κράτους είναι η επίτευξη και η διατήρηση οικονομικής ευημερίας και κοινωνικής ισορροπίας, ώστε να μην υπάρχουν ή να ελαχιστοποιούνται οι δυνάμεις που θα μπορούσαν να ανατρέψουν το κοινωνικο-πολιτικό καθεστώς, που το ίδιο το κράτος εκφράζει.";
            }
            else if (treeView1.SelectedNode.Name == "tree17")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree18")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree19")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree1a1")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree1a2")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree1a3")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree21")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree21")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree21")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree21")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree21")
            {
                textBox3.Text = "LOL its me5";
            }
            else if (treeView1.SelectedNode.Name == "tree22")
            {
                textBox3.Text = "LOL its me6";
            }
            else if (treeView1.SelectedNode.Name == "tree23")
            {
                textBox3.Text = "LOL its me7";
            }
        }

        private void label6_Click(object sender, EventArgs e)
        {

        }

        private void savetofile_Click(object sender, EventArgs e)
        {
            string filename = (filenamebox + ".txt").ToString();
            filename = filename.Replace("System.Windows.Forms.TextBox, Text: ", "");
            Console.WriteLine(filename);
            File.WriteAllText(filename, listaApot.Text);
        }
    }
}
